{
  "backend/main.mo": "Main Motoko actor implementing a luxury furniture e-commerce backend with product management, cart/wishlist, orders, coupons, user profiles, Stripe payment integration, and role-based access control using authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features related to product display fixes, luxury UI redesigns (hero, featured products, categories, testimonials sections) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including routing, React Query hooks, layout components, authentication, home page sections, product displays, cart/wishlist functionality, and admin pages with luxury design aesthetic.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using oklch color space for luxury furniture brand styling.",
  "frontend/index.html": "HTML entry point for the Royal Furniture React application with root div and module script reference.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for public pages (home, shop, product details, checkout, orders) and admin pages (dashboard, products, orders, coupons) wrapped in theme provider with toast notifications.",
  "frontend/src/components/admin/AdminLayout.tsx": "Admin layout wrapper component with sidebar navigation for dashboard, products, orders, and coupons, including admin permission check and access denied handling with loading states.",
  "frontend/src/components/admin/CouponFormModal.tsx": "Modal dialog for creating new discount coupons with code, percentage (1-100), and expiration date validation. Converts dates to nanosecond timestamps and uppercases coupon codes before submission.",
  "frontend/src/components/admin/OrderStatusUpdateModal.tsx": "Modal dialog for updating order status between pending, shipped, and delivered states. Displays current order ID and status before allowing admin to select a new status.",
  "frontend/src/components/admin/PaymentSetup.tsx": "Configuration form for Stripe payment integration with secret key and allowed countries input. Shows success indicator when Stripe is already configured.",
  "frontend/src/components/admin/ProductFormModal.tsx": "Modal form for adding or editing products with fields for name, description, price, stock, discount, category, and image uploads. Handles image file uploads with progress tracking and converts to ExternalBlob format.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button that toggles between login and logout states using Internet Identity. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Non-dismissible modal that prompts authenticated users without profiles to complete their name, email, and optional phone number. Automatically appears when user is logged in but has no profile.",
  "frontend/src/components/cart/AddToCartButton.tsx": "Button component for adding products to cart with quantity parameter. Requires authentication and shows appropriate messaging for logged-out users.",
  "frontend/src/components/cart/CartDrawer.tsx": "Sliding drawer displaying cart items with product details, calculates subtotal with discounts, and provides checkout navigation. Shows empty state with browse products button when cart is empty.",
  "frontend/src/components/cart/CartItemCard.tsx": "Displays a single cart item with product image, name, price, quantity controls (increment/decrement), and remove button. Handles quantity updates and item removal with toast notifications.",
  "frontend/src/components/checkout/AddressForm.tsx": "Form component for entering shipping address with fields for street, city, state, zip, and country. Pre-fills from user profile's default address and notifies parent component of address changes.",
  "frontend/src/components/checkout/CouponInput.tsx": "Input field with apply/remove button for coupon codes. Validates coupon via actor, applies discount percentage, and shows success/error toasts.",
  "frontend/src/components/checkout/OrderSummary.tsx": "Displays order breakdown including itemized cart items, subtotal, discount, shipping, and total price with formatted currency display.",
  "frontend/src/components/common/AccessDeniedScreen.tsx": "Full-screen error page shown when user lacks admin privileges, with shield icon and button to return home.",
  "frontend/src/components/contact/ContactForm.tsx": "Contact form with name, email, phone, and message fields. Simulates submission with timeout and shows success toast.",
  "frontend/src/components/home/CategoriesSection.tsx": "Grid of six furniture category cards (Sofa, Family Sofa, Office Chair, Tables, Beds, Dining Sets) that navigate to shop page with category filter on click.",
  "frontend/src/components/home/FeaturedProductsSection.tsx": "Displays first four products from catalog in a grid with loading skeletons, error handling, and a button to view all products in the shop.",
  "frontend/src/components/home/HeroSection.tsx": "Full-height hero banner with background image, gradient overlay, luxury furniture tagline, and call-to-action button to explore the shop collection.",
  "frontend/src/components/home/StoreInfoSection.tsx": "Displays showroom visit information including store hours, physical address in Guwahati, contact phone number, and an embedded Google Maps iframe for location.",
  "frontend/src/components/home/TestimonialsSection.tsx": "Renders a testimonials section with three hardcoded customer reviews, each displaying a 5-star rating, customer name, and comment in a styled card layout.",
  "frontend/src/components/home/WhyChooseUsSection.tsx": "Displays four feature cards highlighting business value propositions: premium quality, extensive collection, expert consultation, and affordable luxury with icons and descriptions.",
  "frontend/src/components/layout/Footer.tsx": "Footer component with four columns containing brand info, quick navigation links, contact details, and social media link to Facebook, plus copyright notice.",
  "frontend/src/components/layout/Header.tsx": "Sticky header with logo, desktop/mobile navigation, authentication state, cart/wishlist icons with item counts, and integrated cart drawer and login functionality.",
  "frontend/src/components/products/BuyNowButton.tsx": "Button component that adds a product to cart and navigates to checkout, requiring authentication and showing loading state during mutation.",
  "frontend/src/components/products/ProductCard.tsx": "Product card component displaying image, name, price with discount, rating, stock status, wishlist button, and add-to-cart action with hover effects.",
  "frontend/src/components/products/ProductImageGallery.tsx": "Image gallery with main display and thumbnail grid, supporting navigation between multiple product images with previous/next buttons.",
  "frontend/src/components/reviews/AddReviewForm.tsx": "Form component for authenticated users to submit product reviews with star rating (1-5) and text comment, using React hooks for state management and toast notifications.",
  "frontend/src/components/reviews/ReviewSection.tsx": "Displays a list of product reviews with star ratings, comments, user names, and timestamps; shows a placeholder message when no reviews exist.",
  "frontend/src/components/shop/CategoryFilter.tsx": "Checkbox-based filter component for selecting product categories (Sofa, Family Sofa, Office Chair, Tables, Beds, Dining Sets) with multi-select support.",
  "frontend/src/components/shop/PriceRangeFilter.tsx": "Price range filter with min/max input fields and apply/reset buttons, defaulting to 0-1,000,000 rupees.",
  "frontend/src/components/shop/SortDropdown.tsx": "Dropdown select component for sorting products by newest, price (low to high), or popularity.",
  "frontend/src/components/wishlist/WishlistButton.tsx": "Heart icon button that toggles product wishlist status for authenticated users, with visual feedback for active state.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, handling admin token initialization and query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including products, cart, wishlist, orders, coupons, user profiles, addresses, and reviews with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, Google Fonts (Playfair Display and Montserrat), and defines a luxury beige/gold color theme with CSS custom properties for light and dark modes, plus utility classes for animations and shadows.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying Royal Furniture's brand story, mission, vision, and showroom information with hero section, text content, and ProfileSetupModal.",
  "frontend/src/pages/admin/AdminCouponsPage.tsx": "Admin page for managing discount coupons with a table view showing code, discount percentage, and expiry date. Includes add and delete functionality via modal.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard page displaying key metrics (revenue, orders, products, coupons) with admin permission checks, Stripe configuration alerts, payment setup component, and low stock product warnings.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin orders management page showing a table of all orders with status badges, date, total amount, and an update status modal for order management.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin products management page with a table displaying product images, details, stock levels, and actions for adding, editing, and deleting products via a modal form.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that handles cart review, address input, coupon application, order summary calculation, and Stripe payment session creation with authentication checks.",
  "frontend/src/pages/ContactPage.tsx": "Contact page displaying a contact form, business information (phone, hours, address), and an embedded Google Maps iframe for the Royal View Building location in Guwahati.",
  "frontend/src/pages/HomePage.tsx": "Main landing page composing multiple sections: hero, featured products, categories, why choose us, testimonials, and store info with luxury dividers between sections.",
  "frontend/src/pages/OrderDetailsPage.tsx": "Order details page that fetches and displays a specific order by ID, showing order items with product images, status badge, and loading/error states.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a user's order history with order cards showing ID, date, total amount, and status badges. Shows an empty state with a call-to-action to browse products when no orders exist.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Payment failure page displaying an error icon and message with buttons to retry payment or contact support.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Payment success confirmation page that invalidates the cart query and provides navigation to order history or continue shopping.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Product detail page with breadcrumb navigation, image gallery, product info (price, discount, stock), add-to-cart/buy-now buttons, and review section. Handles loading and error states with appropriate UI.",
  "frontend/src/pages/ShopPage.tsx": "Main shop page with sidebar filters (category, price range), sort dropdown, and product grid. Implements client-side filtering and sorting with loading skeletons and error handling.",
  "frontend/src/pages/WishlistPage.tsx": "Wishlist page displaying saved products in a grid with options to add to cart or remove from wishlist. Shows empty state when no items are saved.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom luxury brand theme with Playfair Display and Montserrat fonts, beige/gold color palettes, luxury shadows, and extended design tokens using OKLCH color space.",
  "project_state.json": "Project metadata defining Royal Furniture luxury e-commerce site with React/Node.js stack, payment integration requirements, known issues with home page design and product display, and comprehensive feature list."
}